#   五阶方程无根式通解
今天我分享一个有意思的话题

五阶方程无根式通解的原因

我分享它的原因有三点

一个是因为这个常识很早就知道了,但我一直不知道为什么,这很困恼我

第二是因为近似代数逃课太多,心有愧疚,希望做一期复习,以致敬意

第三个是因为我认为现有的一些讲解讲的不够好,不够系统,深度过深或过浅,或者浪费时间讲了太多无关内容

那什么样的人看这个视频合适,这个分享期望达到什么目标呢

其实,这个视频比较适合有一定代数基础想复习或回顾的同学,之前尚未证明过此命题的同学.所以这并不是无门槛的分享.

这个分享的内容非常简短,实际上待会就会发现,我把原有ppt里的很多内容都做了删减

我们的主要的目标是回答五次方程的问题,当然半路可能会顺手解决一些其它问题

废话少说,我们先快速复习一下基础知识
##  群环体域
群是一个集合加算符,这个算法满足结合律,存在单位元和逆元.

如果这个算符补上交换律,它进阶为阿贝尔群

如果集合是个有限集,那群就是有限群

考虑一种特殊的群,它是一个群到自身的一一映射,映射作为元素,映射和自己的复合作为算符,它也能构成群,称为全变换群,显然如果那个群是个n元群,那全变换群的阶为n的阶乘

这个n元群的全变换群称为n级对称群,记为sn

现在我们考虑全变换中的一种特例,我们称它为轮换,具体看这个图

在一个群上的7轮换,是指找出七个元素完成一次右移

显然1轮换是恒等映射

我们称2轮换是个对换,也就是swap(a,b)

现在我们给出一个命题,任意变换都可以由有限个对换符合

这是显然的,参见冒泡排序

好,回到我们的基础部分

如果一个群是由一个元素生成的,即任何其它元素都可以通过该元素有限次加法得到,那么这个群是个循环群

一个元素回到单位元的最小自加次数就是它的阶.考虑Z4,显然1的阶是4,2的阶是2,3的阶是4

我们定义过子群,我们通过子群和一个元素的加法.来定义新的概念:陪集

例如Z4的子群{0,2}加上1得到{1,3},加上2得到{0,2},加上3得到{1,3},加上0得到{0,2},这四个都集合都称为陪集.

这个时候我们可以给出一个命题:通过陪集扩域诱导等价类,回到上一页来证明一下

等价的定义如上,如果一个元素可以通过h中的元素与另一元素相加得到,那么这两元素等价.

自反成立
对称也成立

传递也成立.

实际上我们看到Z4的在{0,2}下确实被分成了两个等价类,1和3等价,0和2等价.
我们称这个群的类别数为子群指数

现在直接给出拉格朗日定理,子群类别数和该子群的阶的积等于群的阶

我们可以给出一个推论,一个有限群的某元素a的阶可以整除群的阶.因为它本身可以诱导一个o(a)的循环子群对不对.

继续补上两个定义

如果一个子群具有左右陪集相同,那么这就是一个正规子群.
显然阿贝尔群的子群都是正规子群

如果一个群的只有平凡子群, 那么它是个单群.
比如素阶群一定是单群,自己去想.

引入正规子群的目标是让等价类自身成群,这样群定义为商群.
.
下面引入两个关键的映射,同态和同构

如果从G到G1的映射能与两个群各自的算符交换顺序(外提),那这就是个同态映射

显然同态之下,单位元映射到单位元

如果在同态的基础上,这个映射还是可逆的,那么同态升级为同构

同态条件下,值域中的单位元的原像称为核,kernel

显然核是原群的正规子群.因为把0展开成0+0,0=a-a,可得核运算封闭,单位元必然在其中,逆元也在,且左右陪集相等.

值域的元素至少存在一个原值,由该原值所在的商群(核诱导的商群)元素到该值的映射是一个同构.

由此我们我们可以给出同态基本定理,核诱导的商群同构于同态的像

看个简单的实例.R3到R的压缩映射,x,y归零,z不动,保留空间的加法.显然这是个同态映射,它的核是R2,R2诱导的分类是,如果两个点在同一个平行于底平面的平面,就是一类,而这个等价类和Z轴R同构.


我们现在解决一个小问题:4,5阶群的唯一性

首先什么是唯一,如果任意两个两群同构,则称他们唯一

G5唯一吗?
由拉格朗日定理推论可知,任取一非单位元元素,它的阶都是5,即任一元素可生成此群,不妨设它为1,可知它同构于Z5,即所有的G5都同构于Z5,即G5唯一

而G4的元素的阶可以是1,2,4,显然Z4是一种实现,但我们还可以构造另一种任一非0元素的阶都是2的G4实现,参考2位的异或运算,00,01,10,11,除了00,各个元素的阶都是2.我们记这个群是克莱因群

下面证克莱因群和Z4不同构,即任取一个同态,总会有3个克莱因群的元素映射到Z4中的2,这违背了同构的一一映射的定义.

即G4不唯一.

在阿贝尔群的基础上,我们补上乘法运算,且加法和乘法服从分配率.我们得到环
在环的基础上补上乘法幺元,我们得到幺环,补上乘法交换律,得到交换环

注意,我们并未许诺元素有乘法逆元.

一个常见的交换幺环就是定义了加法和乘法的整数了.因为它加法成群,存在1这个乘法单位元,且乘法可交换.

正如我们在群里定义子群,正规子群,最后得到商群,我们在环上也定义子环,理想和商环.

我们希望把一个环除开.这个时候我们需要理想.

理想的定义是一个能吸收乘法结果的子群.(严格细分的话,理想包括左理想和右理想)

显然子群满足如下公式,这得益于理想吸收乘法结果的能力.

理想能帮我们诱导等价类,且等价类本身依然成环.这大家自己去证.

因此,我们可以类比于商群,得到商环.例如Z的子环5的整数倍,可以把Z除成5个元素,同构于Z5环


如果一个交换幺环还有乘法逆元,它就成了域,例如有理数域.

一如我们定义了子群,子环,我们也定义子域,即依然成域的子集.

如果一个域是素数阶,那它称为p元伽罗瓦域

特征我们跳过


接下来我们要证明一个非常重要的命题:A5的单性,理论上这个应该放在前面讲,但前面大家可能还没预热,所以我把他滞后了.

S5是五个元素全变换构成的群.

而任一变换都是有限次对换的乘积,如果这个对换的次数是偶数次,那我们称这些变换构成群是个交错群,显然定义是合法的,因为偶数次对换和偶数次对换的符合依然是偶数次对换即运算封闭,且恒等变换,即单位元存在,逆操作也是是偶数次,即逆元存在.即交错群的定义没有问题.我们记这个群是An


现在我们的目标是证明A5及以上的交错群是单群.
我这里参考的是教材51页的证明,如果谁有更优雅的证明可以发起个merge request.

好.

我们先给出这个命题:任两个对换是三轮换的乘积.
不妨设该两对换是如下形式,如果j等于l,那它等于ijk,否则等于ijk jkl

由此可得An中的任一元素是三轮换的乘积

我们最终的命题等价于在n大于等于5时,如果一个群是An的正规子群,且它不平凡,那么它必然就等于An

整体的思路是先证H至少有一个3轮换,使用反证法来证,然后通过这个三轮换证明H包含全部的三轮换,进而证明An包含于H中,即An等于H

好,我们先证H至少有一个三轮换
这个命题的证明思路是设H中动点最少的那个非恒等置换是t,显然它至少是3轮换,然后我们证明这个三轮是取得到的,即动点最少的那个非恒等置换的动点数是3.不动点是n-3.
把t的轮换按长短从左往右排,t只有如下两种形态.

下面我们用反证法来证D(t)=n-3
如果最少动点的置换的东动点数多于3,在第一种情况下,t必然形如(1,2,3,4,5,,,),一定会取到5或以上,因为1234是奇数次置换.
在这个t上我们用sigma来构造t',t'进一步构造t1,有H的正规子群性质,这个t1仍然在H中,且我们代入发现t1比t还多一个不动点,t1的动点还少,这和t的假设冲突.

即便对于第二情况,也能构建一个t1,在这个构造下,1,2都不动,也比t有更多不动点

这都矛盾于最少动点多于3的这一假设.

进而可得

H的最少动点数是3,即H至少包含一个三轮换.

回顾一下我们的思路,H可以包含全部三轮换才是我们的目标命题

这个不难,因为对于任意三轮换,通过我们之前的最小轮换t构造出v,这个v总能通过对换成为偶置换,ijk可以有v和t构造,由正规子群的性质可得,它依然属于H.
即任意三轮换都在H中.

综上
最终:n不小于5时,An必然是单群.

记住这个命题.至少记10分钟吧.

因为如果说我们要集齐两张卡牌才能通关的话,这就是第一张.

继续回到域的概念

如果一个域K是由F域添加S集合的元素得到的扩域,我们用这个符号表示三者的关系

如果S是个一元集合,那称K是F上添加s的单扩张

例如Q(根号2)

域的同态和同构的定义继承自环

我们引入一个关键概念F-嵌入和F同构.

它是指两个都来自F的扩展,他们用同态关联,且保持F的元素都不动,这个时候称它是F-嵌入.如果这个同态还是同构,那称它是F嵌入

显然E是F扩域,恒等映射是个F-嵌入也是F同构.

emmm.

这块跳过.想复习的可以暂停看一看.

扩张可以得到一个线性空间,因K在F的扩展,KK相加得到K,F乘K落入K,且满足其它线性空间的公理.
我们记这个F到K的扩张是一个线性空间

既然是线性空间,我们可以度量它的维数,例如Q通过根号2和3的立方根得到的扩展,我们可以得到在以Q为F的扩展线性空间.它的基包含1,根号2,3的立方根和 根号2与3的立方根.因为四者无法通过非全零有理数乘积的求和等于0. 即四者独立.
我们记这个空间的维数就是这个域扩张的次数
如果扩张的维数是有界的,称它是有限扩张.

这些,都跳过.

我们先歇一歇.来看一个小学难题,尺规作图不可得三等分角.

我们先想一下尺规作图能有哪些操作,我们可以用直尺连接已知的两个点,可以做任意线段的垂线,可以通过已知半径做圆.更进一步地,我们可以将任意线段,任意n等分,即在给出单位长的情况下,我们可以得到全部有理数.

由此,我们不妨建立一个坐标系,在初始状态,任意坐标为有理数的点都可以得到,接下来,我们的作图操作只可能得到如下三种情况的新的点,线线相交得到的点,线圆相交,圆圆相交.
其中线线相交得到的点的坐标仍然在上一个域上.
圆线相交得到的点的坐标,通过方程求解,必然要么不扩域或要么是2次扩域,不懂的话可以先.暂停想想

而对于圆和圆相交,它的代数方程依然是二次的,求解结果依然顶多是二次扩域内的元素.

这样一来,任意有限次尺规作图,得到的扩张域的序列都是Q的2的幂次扩张.

我们用反证法来证明不可对任意角,尺规作图3等分.

假设给出一个角theta,它的端点都在某中间域Li中,我们通过尺规作图得到了三等分点,我们通过解这个余弦方程,可知,这个三等分的端点是对原域的三次扩域.即新的域是Li的三次扩展

这与之前的结论相悖.即这个点没法落在尺规扩域的空间中.

其实这一切的根源就在于扩展的方式所具有的局限性.换言之尽管在不断扩张,但域还是不完备的.


这里有个形象的图,表示存在一些数落入了域的缝隙之中的点.

进一步的,大家可以想想为什么尺规可以作图得到正十七边形.我就不做解答了

回到域的概念.

分裂域,它依然描述的是一个扩展,但这个扩展是由一个F为系数的多项式函数的零点生成的扩张得到.

例如在Q上的X2-3,X3-1得到的正负根号2和1的i的3分之2kπ,这是f诱导的分裂域

在分裂域的概念基础上,如果这个小f多项式函数,不会漏零点,称它为正规扩张


在分裂域的概念基础上,再加一个性质,零点不重合,则这个扩展是可分扩张

可分和正规意味着什么?

这个多项式的零点不重合且没漏掉一个,都参与到了扩张中.

在伽罗瓦理论之前,再补几个概念

从F到K的F自同构的显然成群.我们称这个群是伽罗瓦群

如果一个扩展即是可分且正规,那他是一个伽罗瓦扩张.


好,接下来的我不给证明地给出以下两个定理

伽罗瓦基本定理说的是 伽罗瓦扩张中,伽罗瓦群的子群集合和该扩张中的中间域一一对应.

对于五次方程来说,Gal(K/F)的扩展对应的显然是S5,因为它是一个F同构,F域上的点不能动,能动的点有且只有5个零点,这是由可分和正规保证的.

在此基础上,伽罗瓦定理给出,对于通过添加根式代数元得到的伽罗瓦扩张,其伽罗瓦对应下的群是可解群.

我们直接应用这两个定理,假设5次方程有根式通解,即K是Q的根式伽罗瓦扩张.应用伽罗瓦基本定理和定理,Gal(K/F)对应的群S5是可解群,而可解群的定义是该群存在正规子群列,使得邻接子群的商群是个阿贝尔群.

可是S5的正规子群列是e A5 S5 ,A5到e之间没有更多的正规子群,这引用了我们前面的A5的单性,这意味着A5只能去除e了,A5除e还是A5,可A5不具有交换性,这里有个不可交换的实例. 这意味着S5是不可解群, 即和伽罗瓦定理冲突.

证毕.

回顾一下,我们讲了群环体域的1%的基本知识,顺手解决了几个几何问题.最后的五次方程问题,我们只拿下了A5的单性这个命题,且是关键的伽罗瓦定理我们没证.这就留给大家自己去挖掘吧,但考试应该是不会考的.

拜拜





##  三等分角
扩域,得到的域序列,这个空间不具备完备性.柯西列的收敛点不在其中
##  五阶方程

